let questions = [
    {
        numb: 1,
        question: "كم عدد أركان الاسلام؟",
        answer: "B.5",
        options: [
            "A.3",
            "B.5",
            "C.4",
            "D.6"
        ]
    },
    {
        numb: 2,
        question: "كم عدد أركان الأيمان ؟",
        answer: "C.6",
        options: [
            "A.4",
            "B.5",
            "C.6",
            "D.3"
        ]
    },
    {
        numb: 3,
        question: "هل الاحسان من أركان الايمان؟",
        answer: "B.لا",
        options: [
            "A.نعم",
            "B.لا",
            "C..",
            "D.."
        ]
    },
    {
        numb: 4,
        question: "كم عدد أركان الاحسان؟",
        answer: "C.1",
        options: [
            "A.3",
            "B.2",
            "C.1",
            "D.4"
        ]
    },
    {
        numb: 5,
        question: "ماهو الاحسان ؟",
        answer: "A.أن تعبد الله كأنك تراه",
        options: [
            "A.أن تعبد الله كأنك تراه",
            "B.الايمان بالله",
            "C.بر الوالدين",
            "D.."
        ]
    },
    {
        numb: 6,
        question: "كم كان عمر النبي محمد عليه الصلاة والسلام عندما مات",
        answer: "C.63",
        options: [
            "A.61",
            "B.62",
            "C.63",
            "D.65"
        ]
    },
    {
        numb: 7,
        question: "كم كان عمر النبي عندما نزل اليه الوحي؟",
        answer: "B.40",
        options: [
            "A.42",
            "B.40",
            "C.43",
            "D.26"
        ]
    },
    {
        numb: 8,
        question: "هل الهجرة من بلد الشرك الى بلد الاسلام فريضة؟",
        answer: "C.نعم فريضة لكن ليست على المستضعفين ",
        options: [
            "A.نعم",
            "B.لا",
            "C.نعم فريضة لكن ليست على المستضعفين ",
            "D.."
        ]
    },
    {
        numb: 9,
        question: "كم عددسورالقران الكريم",
        answer: "B.114",
        options: [
            "A.145",
            "B.114",
            "C.120",
            "D.104"
        ]
    },
    {
        numb: 10,
        question: "ما هي أول غزوة في الاسلام؟",
        answer: "B.غزوة بدر الكبرى",
        options: [
            "A.غزوة احد",
            "B.غزوة بدر الكبرى",
            "C.غزوة الخندق",
            "D.غزوة الأحزاب"
        ]
    },
    {
        numb: 11,
        question: "ما هي أول قبلة للصلاة ؟",
        answer: "C.قبلة المسجد الأقصى",
        options: [
            "A.قبلة مكة",
            "B.قبلة المسجد النبوي",
            "C.قبلة المسجد الأقصى",
            "D.قبلة جبل احد"
        ]
    },
    {
        numb: 12,
        question: "كم عدد ابواب الجنة؟",
        answer: "A.8",
        options: [
            "A.8",
            "B.7",
            "C.6",
            "D.2"
        ]
    },
    {
        numb: 13,
        question: "كم عدد أبواب جهنم؟",
        answer: "B.7",
        options: [
            "A.8",
            "B.7",
            "C.6",
            "D.5"
        ]
    },
    {
        numb: 14,
        question: "أين الله؟",
        answer: "C.في السماء فوق العرش",
        options: [
            "A.في الأرض",
            "B.في كل مكان",
            "C.في السماء فوق العرش",
            "D.ليس له مكان"
        ]
    },
    {
        numb: 15,
        question: "هل الاسلام من شروط الصلاة؟",
        answer: "B.نعم",
        options: [
            "A.لا",
            "B.نعم",
            "C..",
            "D.."
        ]
    },
    {
        numb: 16,
        question: "هل تغسيل الميت ينقض الوضوء؟",
        answer: "B.نعم",
        options: [
            "A.لا",
            "B.نعم",
            "C..",
            "D.."
        ]
    },
    {
        numb: 17,
        question: "كم عدد أركان الصلاة؟",
        answer: "A.14",
        options: [
            "A.14",
            "B.13",
            "C.12",
            "D.10"
        ]
    },
    {
        numb: 18,
        question: "اللهم صل على محمد.. كيف تكون صلاة الله على عبده؟",
        answer: "B.الثناء عليه في الملأ الأعلى",
        options: [
            "A.تصلي عليه الملائكة",
            "B.الثناء عليه في الملأ الأعلى",
            "C.نفسها الصلاة المفروضة علينا",
            "D.."
        ]
    },
    {
        numb: 19,
        question: "اذا سقط ركن من أركان الصلاة سهوا أو عمدا تبطل الصلاة؟",
        answer: "A.نعم",
        options: [
            "A.نعم",
            "B.لا",
            "C..",
            "D.."
        ]
    },
    {
        numb: 20,
        question: "من هو الملك الموكل بالنفخ في الصور يوم القيامة؟",
        answer: "B.اسرافيل",
        options: [
            "A.ميكائيل",
            "B.اسرافيل",
            "C.جبريل",
            "D.عزرائيل"
        ]
    }
];
